KozikGIT/RC_car_stm32/RC car F411 F401/RC_CAR/samochodzik_RX/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          :
  * Projekt: PMIK
  * Wykonawcy: Jakub Zelech, Patryk Kozicki
  * Krótki opis całości projektu: Zdalnie sterowany, za pomocą joystika samochodzik, gdzie wykorzystywane są dwa mikrokotrolery: STM32F411, STM32F401 oraz dwa nadajniko-odbiorniki nrf24.
  *
  * Ten plik to funkja główna, części projektu dotyczącej mikrokontrolera odbierającego sygnał, a więc tego, połączonego bezpośrednio z samochodzikiem(RX)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "spi.h"
#include "tim.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/**
** dołączany do pliku jest plik nagłówkowy, w którym to: zdefiniwane są porty nrf24, prędkości przesyłu oraz moce nadajnika, rejestry oraz nagłówki funkcji*/
#include "nrf24l01p.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
int last = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void set_motor();
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/**
** struktura danych wykorzystywana do odbierania sygnału w pętli*/
uint8_t rx_data[NRF24L01P_PAYLOAD_LENGTH] = {0};

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI2_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */
  /**
  ** inicjalizacja nrf przy 2500MHz oraz 1Mbps transmisji*/
  nrf24l01p_rx_init(2500, _1Mbps);
  /**
  **   */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	set_motor();


    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	if(GPIO_Pin == NRF24L01P_IRQ_PIN_NUMBER)
		nrf24l01p_rx_receive(rx_data); // read data when data ready flag is set
}

/**
  * @brief
  * funkcja sterująca silnikami na podstawie odebranych danych
  * @retval None
  */
void set_motor()
{if (rx_data[0] < 6 && last != rx_data[0])
{
	  TIM2->CCR1 = 0;
	  TIM3->CCR1 = 0;

	  HAL_Delay(2);

	  HAL_GPIO_WritePin(GPIOA, in1_Pin, SET);
	  HAL_GPIO_WritePin(GPIOA, in2_Pin, RESET);

	  HAL_GPIO_WritePin(GPIOA, in3_Pin, SET);
	  HAL_GPIO_WritePin(GPIOA, in4_Pin, RESET);

	  HAL_Delay(1);

	  last = rx_data[0];
}
else if (rx_data[0] > 5 && last != rx_data[0])
{
	  TIM2->CCR1 = 0;
	  TIM3->CCR1 = 0;

	  HAL_Delay(1);

	  HAL_GPIO_WritePin(GPIOA, in2_Pin, SET);
	  HAL_GPIO_WritePin(GPIOA, in1_Pin, RESET);

	  HAL_GPIO_WritePin(GPIOA, in4_Pin, SET);
	  HAL_GPIO_WritePin(GPIOA, in3_Pin, RESET);

	  HAL_Delay(1);

	  last = rx_data[0];
}

if (rx_data[0] == 0)
{
	  TIM2->CCR1 = 0;
	  TIM3->CCR1 = 0;
}
else if (rx_data[0] == 1)
{
	  TIM2->CCR1 = 1000;
	  TIM3->CCR1 = 1000;
}
else if (rx_data[0] == 2)
{
	  TIM2->CCR1 = 0;
	  TIM3->CCR1 = 1000;
}
else if (rx_data[0] == 3)
{
	  TIM2->CCR1 = 750;
	  TIM3->CCR1 = 1000;
}
else if (rx_data[0] == 4)
{
	  TIM2->CCR1 = 1000;
	  TIM3->CCR1 = 0;
}
else if (rx_data[0] == 5)
{
	  TIM2->CCR1 = 1000;
	  TIM3->CCR1 = 750;
}
else if (rx_data[0] == 6)
{
	  TIM2->CCR1 = 1000;
	  TIM3->CCR1 = 1000;
}
else if (rx_data[0] == 7)
{
	  TIM2->CCR1 = 750;
	  TIM3->CCR1 = 1000;
}
else if (rx_data[0] == 8)
{
	  TIM2->CCR1 = 1000;
	  TIM3->CCR1 = 750;
}

HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);

HAL_Delay(98);
	}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
